Repository: Filoz/core
Catalog: translations/validators.*.xlf
Languages: uk

source: This value should be false.
uk: Це значення повинно бути хибним.

source: This value should be true.
uk: Це значення повинно бути істинним.

source: This value should be of type {{ type }}.
uk: Це значення повинно бути типу {{ type }}.

source: This value should be blank.
uk: Це значення повинно бути порожнім.

source: The value you selected is not a valid choice.
uk: Вибране вами значення не є допустимим.

source: 0d999f2
uk: Ви повинні вибрати не менш, ніж {{ limit }} варіантів. | Ви повинні вибрати не менш, ніж {{ limit }} варіантів.

source: One or more of the given values is invalid.
uk: Одне або декілька зазначених значень неприпустимі.

source: This field was not expected.
uk: Це поле не очікувалося.

source: This field is missing.
uk: Це поле відсутнє.

source: This value is not a valid date.
uk: Це значення не є дійсною датою.

source: This value is not a valid datetime.
uk: Це значення не є допустимою датою и часом.

source: This value is not a valid email address.
uk: Це значення не є дійсною адресою електронної пошти.

source: The file could not be found.
uk: Файл не знайдено.

source: The file is not readable.
uk: Файл не може бути прочитаним.

source: 1ad411a
uk: Файл занадто великий ({{ size }} {{ suffix }}). Допустимий максимальний розмір: {{ limit }} {{ suffix }}.

source: 30a318d
uk: Неприпустимий MIME-тип файлу ({{ type }}). Допустимі MIME-типи: {{ types }}.

source: This value should be {{ limit }} or less.
uk: Це значення повинно бути {{ limit }} або менше.

source: 0e0c1e1
uk: Це занадто довге значення. Воно повинно містити не більш, ніж {{ limit }} символів. | Це значення занадто довге. Воно повинно містити не більш, ніж {{ limit }} символів.

source: This value should be {{ limit }} or more.
uk: Це значення повинно бути {{ limit }} або більше.

source: 5188ff9
uk: Це занадто коротке значення. Воно повинно містити символ {{ limit }} або більше. | Це значення занадто коротке. Воно повинно містити {{ limit }} символів або більше.

source: This value should not be blank.
uk: Це значення не повинно бути порожнім.

source: This value should not be null.
uk: Це значення не повинно бути нульовим.

source: This value should be null.
uk: Це значення повинно бути нульовим.

source: This value is not valid.
uk: Це неприпустиме значення.

source: This value is not a valid time.
uk: Це значення не є допустимим часом.

source: This value is not a valid URL.
uk: Це значення не є допустимим URL.

source: The two values should be equal.
uk: Два значения повинні бути рівні.

source: The file is too large. Allowed maximum size is {{ limit }} {{ suffix }}.
uk: Файл занадто великий. Допустимий максимальний розмір: {{ limit }} {{суффикс}}.

source: The file is too large.
uk: Файл занадто великий.

source: The file could not be uploaded.
uk: Не вдалося завантажити файл.

source: This value should be a valid number.
uk: Це значення повинно бути дійсним числом.

source: This file is not a valid image.
uk: Цей файл не є дійсним зображенням.

source: This is not a valid IP address.
uk: Це недійсна IP-адреса.

source: This value is not a valid language.
uk: Це значення не є допустимою мовою.

source: This value is not a valid locale.
uk: Це значення не є допустимим мовним стандартом.

source: This value is not a valid country.
uk: Це значення не є допустимою країною.

source: This value is already used.
uk: Це значення вже використовується.

source: The size of the image could not be detected.
uk: Не вдалося визначити розмір зображення.

source: 266051e
uk: Ширина зображення занадто велика ({{ width }} пікселів). Допустима максимальна ширина складає {{ max_width }} пікселів.

source: c1c23f9
uk: Ширина зображення занадто мала ({{ width }} пікселів). Мінімальна очікувана ширина складає {{ min_width }} пікселів.

source: 9a128f7
uk: Висота зображення занадто велика ({{ height }} пікселів). Допустима максимальна высота: {{ max_height }} пікселів.

source: 8a4cd70
uk: Висота зображення занадто мала ({{ height }} пікселів). Мінімальна очікувана высота складає {{ min_height }} пікселів.

source: This value should be the user's current password.
uk: Це значення повинно бути поточним паролем користувача.

source: fd389d6
uk: Це значення повинно містити рівно {{ limit }} символів. | Це значення повинно містити рівно {{ limit }} символів.

source: The file was only partially uploaded.
uk: Файл завантажено тільки частково.

source: No file was uploaded.
uk: Файл не завантажено.

source: No temporary folder was configured in php.ini.
uk: В php.ini не була налаштована тимчасова тека або налаштована тека не існує.

source: Cannot write temporary file to disk.
uk: Неможливо записати тимчасовий файл на диск.

source: A PHP extension caused the upload to fail.
uk: Розширення PHP привело до збою завантаження.

source: b54c218
uk: Ця колекція повинна містити {{ limit }} елементів або більше. | Ця колекція повинна містити {{ limit }} елементів або більше.

source: 949632c
uk: Ця колекція повинна містити {{ limit }} елементів або менше. | Ця колекція повинна містити {{ limit }} елементів або менше.

source: e0582dc
uk: Ця колекція повинна містити рівно {{ limit }} елементів. | Ця колекція повинна містити рівно {{ limit }} елементів.

source: Invalid card number.
uk: Невірний номер карти.

source: Unsupported card type or invalid card number.
uk: Тип карти не підтримується або невірний номер карти.

source: This is not a valid International Bank Account Number (IBAN).
uk: Це недійсний міжнародний номер банківського рахунку (IBAN).

source: This value is not a valid ISBN-10.
uk: Це значення не є дійсним ISBN-10.

source: This value is not a valid ISBN-13.
uk: Це значення не є дійсним ISBN-13.

source: This value is neither a valid ISBN-10 nor a valid ISBN-13.
uk: Це значення не є ни дійсним ISBN-10, ні дійсним ISBN-13.

source: This value is not a valid ISSN.
uk: Це значення не є дійсним ISSN.

source: This value is not a valid currency.
uk: Це значення не є чинною валютою.

source: This value should be equal to {{ compared_value }}.
uk: Це значення повинно дорівнювати {{ compare_value }}.

source: This value should be greater than {{ compared_value }}.
uk: Це значення повинно бути більше {{ compare_value }}.

source: This value should be greater than or equal to {{ compared_value }}.
uk: Це значення повинно бути більше або дорівнювати {{ compare_value }}.

source: This value should be less than {{ compared_value }}.
uk: Це значення повинно бути менше {{ compare_value }}.

source: This value should be less than or equal to {{ compared_value }}.
uk: Це значення повинно бути менше або дорівнювати {{ compare_value }}.

source: This value should not be equal to {{ compared_value }}.
uk: Це значення не повинно дорівнювати {{ compare_value }}.

source: 0eedf91
uk: Це значення не повинно бути ідентичним {{ compare_value_type }} {{ compare_value }}.

source: 9c3ad0f
uk: Співвідношення сторін зображення занадто велике ({{ ratio }}). Допустиме максимальне співвідношення: {{ max_ratio }}.

source: 4376d45
uk: Коэффициент зображення занадто мал ({{ ratio }}). Ожидаемое минимальное співвідношення: {{ min_ratio }}.

source: The image is square ({{ width }}x{{ height }}px). Square images are not allowed.
uk: Зображення квадратне ({{ width }} x {{ height }} пікселів). Квадратні зображення не допускаються.

source: 1dc128a
uk: Зображення в альбомній орієнтації ({{ширина}} x {{высота}} пікселів). Зображення з альбомною орієнтацією не допускаються.

source: 9e27714
uk: Зображення в портретній орієнтації ({{ширина}} x {{высота}} пікселів). Портретно-орієнтовані зображення не допускаються.

source: An empty file is not allowed.
uk: Порожній файл не допускается.

source: The host could not be resolved.
uk: Хост не може бути вирішено.

source: This value does not match the expected {{ charset }} charset.
uk: Це значення не відповідає очікуваному кодуванню {{ charset }}.

source: This is not a valid Business Identifier Code (BIC).
uk: Це недійсний код бізнес-ідентифікатора (BIC).

source: Error
uk: Помилка

source: This is not a valid UUID.
uk: Це недійсний UUID.

source: This value should be a multiple of {{ compared_value }}.
uk: Це значення повинно бути кратним {{ compare_value }}.

source: This Business Identifier Code (BIC) is not associated with IBAN {{ iban }}.
uk: Цей код бізнес-ідентифікатора (BIC) не пов'язаний з IBAN {{ iban }}.

source: This value should be valid JSON.
uk: Це значення повинно бути коректним JSON.

source: This collection should contain only unique elements.
uk: Ця колекція повинна містити тільки унікальні елементи.

source: This value should be positive.
uk: Це значення повинно бути позитивним.

source: This value should be either positive or zero.
uk: Це значення повинно бути позитивним або нульовим.

source: This value should be negative.
uk: Це значення повинно бути негативним.

source: This value should be either negative or zero.
uk: Це значення повинно бути либо негативним, либо нульовим.

source: This value is not a valid timezone.
uk: Це значення не є допустимим часовым поясом.

source: 7e27e92
uk: Цей пароль просочився у результаті витоку даних, його не можна використовувати. Будь ласка, скористайтеся іншим паролем.

source: This value should be between {{ min }} and {{ max }}.
uk: Це значення повинно бути між {{ min }} і {{ max }}.

source: This form should not contain extra fields.
uk: Ця форма не повинна містити зайвих полів.

source: The uploaded file was too large. Please try to upload a smaller file.
uk: Загруженный файл занадто великий. Будь ласка, спробуйте завантажити файл меншого розміру.

source: The CSRF token is invalid. Please try to resubmit the form.
uk: Токен CSRF недійсний. Будь ласка, спробуйте повторно надіслати форму.

source: post.blank_summary
uk: Дайте вашому посту резюме!

source: post.blank_content
uk: Ваш пост повинен містити контент!

source: post.too_short_content
uk: Зміст повідомлення занадто короткий (мінімум {{ limit }} символів)

source: post.too_many_tags
uk: Занадто багато тегів (додайте тегів {{ limit }} або менше)

source: comment.blank
uk: Будь ласка, не залишайте свій коментар порожнім!

source: comment.too_short
uk: Коментар занадто короткий (мінімум {{ limit }} символів)

source: comment.too_long
uk: Коментар занадто довгий (максимум {{ limit }} символів)

source: comment.is_spam
uk: Зміст цього коментаря вважається спамом.

source: user.duplicate_email
uk: Користувач з адресою електронної пошти {{ value }} вже існує.

source: user.duplicate_username
uk: Користувач з ім'ям користувача {{ value }} вже існує.

source: user.not_valid_password
uk: Неправильный пароль. Пароль повинен містити не менш ніж 6 символів.

source: user.not_valid_email
uk: Невірна адреса електронної пошти

source: user.username_invalid_characters
uk: Ім'я користувача повинно містити тільки латинські символи нижнього регістра, цифри і символи підкреслення.

source: user.not_valid_display_name
uk: Недійсне відображене імʼя
